# Caesar Cipher 


### 1. Caesar Cipher 란 ? 
> 가장간단하고 널리알려진 암호화 기술중 하나라고 합니다 . 일반텍스트의 문자가 각 알파벳 아래의 고정된 수의 문자로 대처되채되는 대채암호의 
유형입니다. 

### 2. 특징 
> 이 암호에 수행하는 ㅇ마호화 단계는 종종 비제네르 암호와 같은 복잡한 계획의 일부로 통합되며 여전히 ROT13 시스템에 현대적인 응용 프로그램이 있다. 모든 단일알파벳 대채 암호와 마찬가지로 , 시저암호는 쉽개 깨지고 현대 관행에서는 본질적으로 통신보완을 미제공 


### 3. 예시
> 변환은 두 개의 알파벳을 정렬하여 나타낼 수 있다; 암호 알파벳은 몇 개의 위치에 의해 왼쪽이나 오른쪽으로 회전된 일반 알파벳이다. 예를 들어, 여기에 23의 오른쪽 시프트에 해당하는 세 자리의 왼쪽 회전을 사용하는 시저 암호가 있습니다 (시프트 매개 변수는 키로 사용됩니다):

![Alt text](220px-Caesar_cipher_left_shift_of_3.svg)



### 4.참조 링크 
Caesar Cipher URL : https://gist.github.com/ihoneymon/652be052a0727ad59601
